#include "Inf_font.h"
#include "Inf_w25q.h"

/******************************************************************************
 * 文件名称：Inf_font.c（接口层）
 * 说    明：GB2312全字库读取实现
 ******************************************************************************/

/**
  * 函    数：读取GB2312汉字24字节字模
  * 参    数：GB_H,GB_L 汉字内码（GB2312编码两字节原值，0xA1起）
  * 参    数：Buf 接收24字节字模数据的数组
  * 返 回 值：无
  * 说    明：偏移 = ((94*GB_H + GB_L) - 1410) * 24；
  *           1410为GB2312前1410个符号区（字库未收录），24为单字模大小
  */
void Inf_font_read_gb2312(uint8_t GB_H, uint8_t GB_L, uint8_t* Buf)
{
	uint32_t Addr_offset;

	GB_H -= 0xA1;
	GB_L -= 0xA1;

	Addr_offset = ((94 * GB_H + GB_L) - 1410) * 24;

	Inf_w25q_read_data(Addr_offset, Buf, 24);
}
